## This Notebook contains Pandas section of the course

### Introduction to pandas

Derived from  <b>Pan</b>el-<b>Da</b>ta

It is the most popular library for data handling and it is built directly off of Numpy

We use pandas to read, clean and perform engineering on data 

Note: Make sure that pandas and numpy are installed

###Pandas Series

In [0]:
import numpy as np
import pandas as pd

In [0]:
labels = ['a', 'b','c']
mylist = [10,20,30]
arr = np.array([10,20,30])
d = {"a":10,"b":20,"c":30}

In [73]:
pd.Series(data = mylist)

0    10
1    20
2    30
dtype: int64

In [74]:
#in pandas by default index starts from 0,if we want a labeled index
pd.Series(data = mylist, index=labels)

a    10
b    20
c    30
dtype: int64

In [75]:
# we can also get the same outputs by
pd.Series(mylist,labels)

a    10
b    20
c    30
dtype: int64

In [76]:
#for dictionaries 
pd.Series(d)

# we will get a = 10 , b = 20 and so on....because they all are matched in dctionary

a    10
b    20
c    30
dtype: int64

In [0]:
salesQ1 = pd.Series(data = [250,400,300,280], index = ["USA","CHINA","INDIA","AUSTRALIA"])

In [78]:
salesQ1

USA          250
CHINA        400
INDIA        300
AUSTRALIA    280
dtype: int64

In [0]:
salesQ2 = pd.Series(data = [390,270,800,320], index = ["USA","CHINA","INDIA","JAPAN"])

In [80]:
salesQ2

USA      390
CHINA    270
INDIA    800
JAPAN    320
dtype: int64

In [81]:
salesQ2["CHINA"] #if we want salesq2 of china , we can also do by the following code

270

In [82]:
salesQ2[1]#numbeirng starts from 0 in python and china is in 1st place

270

In [83]:
salesQ1 + salesQ2

AUSTRALIA       NaN
CHINA         670.0
INDIA        1100.0
JAPAN           NaN
USA           640.0
dtype: float64

### Panda Dataframe

Dataframe is our main tool for working with data 

Dataframe is multiple series sharing same index 

We can think of dataframe as being similar to a spreadsheet

In [0]:
import numpy as np
import pandas as pd

In [0]:
columns = ["w",'x','y','z']

In [0]:
index = ['A',"B","C","D","E"]

In [0]:
from numpy.random import randint #to get the random integers

In [0]:
#we and instructor have got different random values, in order to get similar values , we need to set seed 
np.random.seed(42)

data = randint(-100,100,(5,4))

In [89]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [0]:
df = pd.DataFrame(data, index,columns)

In [91]:
df

    w   x   y   z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [92]:
df['w'] #grab a single column

A     2
B     6
C     2
D    16
E    30
Name: w, dtype: int64

In [93]:
type(df['w'])

pandas.core.series.Series

In [94]:
#what if we want two columns??
#Than we have to pass in list of two columns
df[['w','z']]

    w   z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [0]:
# Adding  a new column
df["new"] = df['w']+ df['y']

In [96]:
df["new"]

A    -6
B    94
C   -24
D    19
E   -18
Name: new, dtype: int64

In [97]:
 # dropping a column(removing a column)
 df.drop('new', axis=1) 
 #common mistakes beginners do is, just type df.drop('new'), but by default drop is along axis = 0(along rows), but we are dropping column

    w   x   y   z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [0]:
 df = df.drop('new', axis=1)  #reassign to remove the column permanentaly

In [99]:
df

    w   x   y   z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [100]:
##Lets see how to grab row
# we can remove by using .loc method
df.loc['A']

w     2
x    79
y    -8
z   -86
Name: A, dtype: int64

In [101]:
df.loc[["A","B"]]

   w   x   y   z
A  2  79  -8 -86
B  6 -29  88 -80

In [102]:
# to remove the row, we have to use slicing method
df.iloc[0:3]

   w   x   y   z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [103]:
df

    w   x   y   z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [104]:
df.drop('C')

    w   x   y   z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

### Pandas DataFrames part 2

In [0]:
# NOw let us try how to grab a information off of a dataframe in certain conditions

In [105]:
df

    w   x   y   z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [107]:
 #if we went a sub set of a dataframe where we want only positive numbers 
 df > 0 # we will get the boolean of dataframe

      w      x      y      z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [111]:
df[df>0] #we will get numbers greater than 0 and NaN in place of -ve which is Not a Number

    w     x     y     z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [112]:
df

    w   x   y   z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [114]:
df['x']>0  #gives back a sereis where index values ABCDE and corresponding booleans

A     True
B    False
C     True
D    False
E     True
Name: x, dtype: bool

In [119]:
df[df["x"]>0] #conditional selection statement , very common while dealing with pandas

    w   x   y   z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [122]:
  #to combine the conditions of pandas 
  df[(df['w']>0) & (df['y']>1)]

    w   x   y   z
B   6 -29  88 -80
D  16  -1   3  51

In [125]:
#to reset index
df.reset_index()

  index   w   x   y   z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [126]:
df

    w   x   y   z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [0]:
#Now lets look how we can take a column and set that as index
# we need to have exact number of rows in order to work 
new_ind = ["ca", 'ny','wy','or','co']

In [0]:
df['States'] = new_ind

In [130]:
df

    w   x   y   z States
A   2  79  -8 -86     ca
B   6 -29  88 -80     ny
C   2  21 -26 -13     wy
D  16  -1   3  51     or
E  30  49 -48 -99     co

In [0]:
# what if we want "states" columns as Index
df = df.set_index("States")

In [133]:
df

         w   x   y   z
States
ca       2  79  -8 -86
ny       6 -29  88 -80
wy       2  21 -26 -13
or      16  -1   3  51
co      30  49 -48 -99

In [134]:
df.describe()#gives bunch of informantion about data frame

              w          x          y          z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [135]:
df.info

<bound method DataFrame.info of          w   x   y   z
States
ca       2  79  -8 -86
ny       6 -29  88 -80
wy       2  21 -26 -13
or      16  -1   3  51
co      30  49 -48 -99>

### <b>Missing Data</b>

Real world datasets often have missig data 

3 ways to deal with missing data

<li>Leave it as a missing data</li>
<li> Remove the missing data</li>
<li> fill in missing data</li>

#### Leave it as a missing data

Depending of the type of data, this is a vilid choice 

for ex, if dealing with categorical data, we could simply treat a NaN as another category

#### Remove missing data

Depends on how much data is missing 

1> Large percentage- too much is missing to make a reasonable guess

2> Small percentage - only removes a few data points from our dataset

#### Fill in the missing data 
A non-trivial percentage is missing and the data point rows are important 

Lots of strategies available

1>Mean , mode, median 

2>based of other features column, conceive of a reasonable value

In [0]:
import numpy as np

import pandas as pd

In [0]:
df = pd.DataFrame({'A':[1,2,np.nan,4],
                  "B":[5,np.nan,np.nan,8],
                  "C":[10,20,30,40]})

In [142]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [143]:
# if we want to remove the missing data 
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [0]:
# So by default it is looking for the rows and delete the rows with NaN

In [146]:
#If we say axis = 1
df.dropna(axis = 1)

    C
0  10
1  20
2  30
3  40

In [148]:
#we can also specify threshold
df.dropna(axis = 1, thresh=2)
#which actually brings back everything , because all the columns have atlest 2 non null values

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [149]:
#Now lets try with threshold with 3 
df.dropna(axis=1,thresh=3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

###### Fill in the missing data

In [151]:
df.fillna(value="FILL VALUE")#we are filling the dataframe with the string FILL VALUE

            A           B   C
0           1           5  10
1           2  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3           4           8  40

In [153]:
df.fillna(value=0) #filled the NaN values with 0

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [154]:
#if we want to fill only one row of the df
df["A"].fillna(value = 0)

0    1.0
1    2.0
2    0.0
3    4.0
Name: A, dtype: float64

In [0]:
df["A"] = df["A"].fillna(value = 0)

In [157]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

In [0]:
# if we want to fill the column B with average value of the column 
df["B"] = df["B"].fillna(value = df["B"].mean())

In [161]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40

In [162]:
 # we can also do this along the whole data frame 
 df.fillna(value = df.mean())

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40

### Groupby Operations

In [0]:
#Split, apply, combine

In [0]:
# the operation choesn with  a groupby() call must be an aggrigation method

In [0]:
#This means we can take multiple values and combine them to return a singular value 
#Singular values like sum std mean count etc

In [167]:
# we are using a csv file
#so to upload csv file to google colab, follow the code shown below
from google.colab import files
file = files.upload()

Saving Universities.csv to Universities.csv

In [0]:
df = pd.read_csv("Universities.csv")

In [169]:
df.head()

                                 Sector  ... Geography
0            Private for-profit, 2-year  ...    Nevada
1  Private for-profit, less-than 2-year  ...    Nevada
2  Private for-profit, less-than 2-year  ...    Nevada
3  Private for-profit, less-than 2-year  ...    Nevada
4               Public, 4-year or above  ...    Nevada

[5 rows x 5 columns]

In [172]:
df.groupby('Year').sum() #total number of completions by year

      Completions
Year
2012        20333
2013        21046
2014        24730
2015        26279
2016        26224

In [173]:
df.groupby('Year').mean() #mean number of completions by year

      Completions
Year
2012   535.078947
2013   526.150000
2014   588.809524
2015   597.250000
2016   609.860465

In [0]:
#there are lot of aggrigate functions to try out

In [177]:
#if we want the index numbers in ascending or descending


df.groupby('Year').sum().sort_index(ascending = False)

      Completions
Year
2016        26224
2015        26279
2014        24730
2013        21046
2012        20333

In [178]:
df.head(
  
)

                                 Sector  ... Geography
0            Private for-profit, 2-year  ...    Nevada
1  Private for-profit, less-than 2-year  ...    Nevada
2  Private for-profit, less-than 2-year  ...    Nevada
3  Private for-profit, less-than 2-year  ...    Nevada
4               Public, 4-year or above  ...    Nevada

[5 rows x 5 columns]

In [183]:
df.groupby(['Year','Sector']).sum()#number of completions per year per sector

                                              Completions
Year Sector
2012 Private for-profit, 2-year                      3072
     Private for-profit, 4-year or above              632
     Private for-profit, less-than 2-year            1327
     Private not-for-profit, 2-year                   665
     Private not-for-profit, 4-year or above         1059
     Public, 2-year                                  1170
     Public, 4-year or above                        12408
2013 Private for-profit, 2-year                      3053
     Private for-profit, 4-year or above              775
     Private for-profit, less-than 2-year            1281
     Private not-for-profit, 2-year                   471
     Private not-for-profit, 4-year or above         1016
     Public, 2-year                                  1633
     Public, 4-year or above                        12817
2014 Private for-profit, 2-year                      2957
     Private for-profit, 4-year or above             1506
     Private for-profit, less-than 2-year            1328
     Private not-for-profit, 2-year                   449
     Private not-for-profit, 4-year or above         1042
     Public, 2-year                                  2286
     Public, 4-year or above                        15162
2015 Private for-profit, 2-year                      3280
     Private for-profit, 4-year or above             1306
     Private for-profit, less-than 2-year            1629
     Private not-for-profit, 2-year                   425
     Private not-for-profit, 4-year or above         1228
     Public, 2-year                                  2355
     Public, 4-year or above                        16056
2016 Private for-profit, 2-year                      3286
     Private for-profit, 4-year or above              748
     Private for-profit, less-than 2-year            1552
     Private not-for-profit, 2-year                   322
     Private not-for-profit, 4-year or above         1208
     Public, 2-year                                  2431
     Public, 4-year or above                        16677

In [184]:
df.groupby("Year").describe()

     Completions
           count        mean          std   min     25%    50%     75%     max
Year
2012        38.0  535.078947  1036.433239  13.0  114.25  229.5  420.50  5388.0
2013        40.0  526.150000  1040.474782   0.0   98.50  189.0  413.00  5278.0
2014        42.0  588.809524  1150.355857   0.0  104.50  203.5  371.75  5093.0
2015        44.0  597.250000  1183.371791   0.0   87.75  191.0  405.75  5335.0
2016        43.0  609.860465  1235.952796   0.0   90.00  208.0  414.00  5367.0

#### Pandas Opertions

In [0]:
df_one = pd.DataFrame({"k1":['A',"A","B","B","C","C"],
                       'col1':[100,200,300,300,400,500],
                       'col2':['NY',"CA","WA","WA","AK","NV"]})

In [186]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [188]:
#To know the unique values , that means will not repeat the same type of data
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [190]:
df_one['col2'].nunique() #number of unique values

5

In [192]:
df_one['col2'].value_counts() #value counts of each value

WA    2
CA    1
NV    1
AK    1
NY    1
Name: col2, dtype: int64

In [194]:
#To drop dupicates 
df_one.drop_duplicates()
#it drops B 300 because, row 2 and 3 were having the same values

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [0]:
df_one['New'] = df_one['col1']*10

In [196]:
df_one

  k1  col1 col2   New
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [0]:
#we can use .apply method to apply any functionality

In [0]:
# imaginw if we want to gram a first letter of col2 and set that as a new column

In [0]:
def grab_firstletter(state):
  return state[0]

In [200]:
grab_firstletter('NY')# this is by normal function method

'N'

In [201]:
#by using .apply method
df_one['col2'].apply(grab_firstletter)

0    N
1    C
2    W
3    W
4    A
5    N
Name: col2, dtype: object

In [0]:
df_one['first letter'] = df_one['col2'].apply(grab_firstletter)

In [205]:
df_one

  k1  col1 col2   New first letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [0]:
#slightly more complex problem
def complex_letter(state):
  if state[0] == 'W':
    return "Washington"
  else:
    return "error"

In [214]:
complex_letter('WA')

'Washington'

In [215]:
df_one['col2'].apply(complex_letter)

0         error
1         error
2    Washington
3    Washington
4         error
5         error
Name: col2, dtype: object

##### Mapping

In [216]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [0]:
my_map = {"A" :1,"B":2,"C":3}

In [219]:
df_one['k1'].map(my_map) #replaces A by 1 , B by 2 and so on....

0    1
1    1
2    2
3    2
4    3
5    3
Name: k1, dtype: int64

In [0]:
df_one['num'] = df_one['k1'].map(my_map)

In [222]:
df_one

  k1  col1 col2   New first letter  num
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000            N    3

In [225]:
#index position of max and min values 
df_one['col1'].max()

500

In [226]:
# if we want the location of max
df_one['col1'].idxmax()

5

In [228]:
#To see all the columns 
df_one.columns

Index(['k1', 'col1', 'col2', 'New', 'first letter', 'num'], dtype='object')

In [0]:
df_one.columns = ['c1','c2','c3','c4','c5','c6']

In [231]:
df_one #we can see that the columns are replaced

  c1   c2  c3    c4 c5  c6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

In [234]:
#sorting , we can select whatever column or row we want to sort by 
df_one.sort_values('c3') # we can notice that c3 is in alphabetical order 
#by default assending is true

  c1   c2  c3    c4 c5  c6
4  C  400  AK  4000  A   3
1  A  200  CA  2000  C   1
5  C  500  NV  5000  N   3
0  A  100  NY  1000  N   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2

#### Now lets take a look at concatinating the data frame

In [0]:
features = pd.DataFrame({"A":[100,200,300,400,500],
                         'B':[12,13,14,15,16]})


predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [238]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [239]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [241]:
#lets imagine that we want to joine these data frames together 
pd.concat([features,predictions],axis = 1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [243]:
#To creaty dummy variables
df_one['c1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: c1, dtype: object

In [247]:
pd.get_dummies(df_one['c1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

### DATA INPUT AND OUTPUT

In [0]:
import numpy as np

import pandas as pd

In [0]:
#for more reference 

#https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#io-store-in-csv

In [250]:
pwd

'/content'

                                   Sector  ... Geography
0              Private for-profit, 2-year  ...    Nevada
1    Private for-profit, less-than 2-year  ...    Nevada
2    Private for-profit, less-than 2-year  ...    Nevada
3    Private for-profit, less-than 2-year  ...    Nevada
4                 Public, 4-year or above  ...    Nevada
..                                    ...  ...       ...
202            Private for-profit, 2-year  ...    Nevada
203               Public, 4-year or above  ...    Nevada
204            Private for-profit, 2-year  ...    Nevada
205        Private not-for-profit, 2-year  ...    Nevada
206                        Public, 2-year  ...    Nevada

[207 rows x 5 columns]

In [0]:
df_one.to_csv("df_one.csv", index = 1) #to convert our work to csv file